rovOsc_h_U0.1_dt300/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    zmin
    {
        type            zeroGradient;
    }

    zmax
    {
        type            fixedValue;
        value           uniform 0;
    }

    "(xmin|xmax|ymin|ymax)"
    {
        type            zeroGradient;
    }

    "BROV2.*"
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
