rovOsc_h_U0.1_dt300/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    BROV2
    {
        type triSurfaceMesh;
        file "BROV2v.stl";
    }

    // symmetric near-body refinement (oscillating flow, no downstream bias)
    nearBox
    {
        type searchableBox;
        min (-0.38 -0.44 -0.28);
        max ( 0.38  0.44  0.28);
    }
};

castellatedMeshControls
{
    maxLocalCells 200000;
    maxGlobalCells 5000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 3;

    features
    (
        {
            file "BROV2v.eMesh";
            level 3;
        }
    );

    refinementSurfaces
    {
        BROV2
        {
            level (2 3);

            patchInfo
            {
                type wall;
            }
        }
    }

    resolveFeatureAngle 60;

    refinementRegions
    {
        nearBox
        {
            mode    inside;
            level   1;
        }
    }

    insidePoint (-2.013 -2.011 -2.017);

    allowFreeStandingZoneFaces false;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
    nFeatureSnapIter 10;
}

addLayersControls
{
    relativeSizes true;
    layers
    {
    }
    expansionRatio 1.0;
    finalLayerThickness 0.3;
    minThickness 0.1;
    nGrow 0;
    featureAngle 100;
    slipFeatureAngle 30;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 2;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 3.5;
    maxInternalSkewness 3.5;
    maxConcave 80;
    minFlatness 0.5;
    minVol -1e30;
    minTetQuality 1e-30;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.02;
    minVolRatio 0.01;
    nSmoothScale 4;
    errorReduction 0.75;
}

mergeTolerance 1e-6;

// ************************************************************************* //
